# Relatório de Análise II

## Tipo de Imóveis

In [2]:
import pandas as pd

In [5]:
dados = pd.read_csv('aluguel.csv', sep=';')
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento
5,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0,50.00,Apartamento
6,Apartamento,Freguesia (Jacarepaguá),3,0,0,54,950.0,300.0,28.0,17.59,Apartamento
7,Apartamento,Barra da Tijuca,2,1,1,67,1700.0,589.0,147.0,25.37,Apartamento
8,Apartamento,Tijuca,2,1,0,110,1900.0,700.0,138.0,17.27,Apartamento
9,Apartamento,Olaria,3,1,0,68,1000.0,670.0,0.0,14.71,Apartamento

In [6]:
dados['Tipo']

0        Apartamento
1        Apartamento
2        Apartamento
3        Apartamento
4        Apartamento
            ...
19826      Quitinete
19827      Quitinete
19828      Quitinete
19829      Quitinete
19830      Quitinete
Name: Tipo, Length: 19831, dtype: object

In [8]:
tipo_de_imovel = dados.Tipo

In [9]:
type(tipo_de_imovel)

pandas.core.series.Series

# Mostrando a quantidade de itens dentro da tabela

In [14]:
tipo_de_imovel.drop_duplicates(inplace=True)

In [15]:
tipo_de_imovel

0               Apartamento
16923                  Casa
17821    Casa de Condomínio
18785          Casa de Vila
19018             Quitinete
Name: Tipo, dtype: object

# Organizando a Visualização

In [16]:
tipo_de_imovel = pd.DataFrame(tipo_de_imovel)

In [17]:
tipo_de_imovel

                     Tipo
0             Apartamento
16923                Casa
17821  Casa de Condomínio
18785        Casa de Vila
19018           Quitinete

In [18]:
tipo_de_imovel.index

Index([0, 16923, 17821, 18785, 19018], dtype='int64')

In [19]:
tipo_de_imovel.shape[0]

5

In [20]:
range(tipo_de_imovel.shape[0]) #verificando o range da variavel

range(0, 5)

In [22]:
for i in range(tipo_de_imovel.shape[0]): #visualizando o for e colocando dentro de um range 
    print(i)

0
1
2
3
4

In [23]:
tipo_de_imovel.index = range(tipo_de_imovel.shape[0]) #definindo o nome da variavel

In [24]:
tipo_de_imovel

                 Tipo
0         Apartamento
1                Casa
2  Casa de Condomínio
3        Casa de Vila
4           Quitinete

In [26]:
tipo_de_imovel.columns.name='Id'

In [27]:
tipo_de_imovel

Id                Tipo
0          Apartamento
1                 Casa
2   Casa de Condomínio
3         Casa de Vila
4            Quitinete

## Series

In [28]:
data =[1,2,3,4,5,6]

In [29]:
s = pd.Series(data)

In [30]:
s

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [46]:
index = ['Linha' + str(i) for i in range(5)]
s = pd.Series(data, index=index)

In [47]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [48]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [44]:
data = {'Linha' + str(i): i + 1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [45]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [49]:
s1=s+2

In [50]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [51]:
s2=s+s1

In [52]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

# DataFrame

In [54]:
data = [[1,2,3],
        [4,5,6], 
        [7,8,9]]

In [55]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [56]:
df1 = pd.DataFrame(data=data)

In [57]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [58]:
index=['Linha' + str(i) for i in range (3)]

In [59]:
index

['Linha0', 'Linha1', 'Linha2']

In [60]:
df1 = pd.DataFrame(data=data, index = index)

In [61]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [62]:
columns = ['Coluna' + str (i) for i in range (3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [63]:
df1 = pd.DataFrame(data=data, index = index, columns=columns)

In [64]:
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9